/*Автор: Рець Вадим Олександрович, група К-12*/
#include <iostream>
#include "copyright.h"
#include <Windows.h>
#include "Builder.h"
#include "Result.h"
#include <string>
using namespace std;

int main(int argc, char* argv[]) {
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	copyright();
	cout << "Дана програма зчитує інформацію про змагання з біатлону (типу спрінт) з файлу. Файл містить статистику біатлонних гонок кубку світу типу «спрінт» з 2-ма вогневими рубежами (порядковий номер етапу, стартовий номер учасника, зайняте місце, прізвище, ім’я, країна, загальний час проходження дистанції (у секундах), час підходу та виходу з кожного вогневого рубежу (відносний, у секундах від початку гонки), загальна кількість промахів, загальний час подолання штрафних кругів). Для тих, хто не завершив гонку вказано загальний час -1. Програма знаходить тих, хто стріляв найточніше (протягом сезону), та виводить по них дані по всіх гонках (етап, стартовий номер, зайняте місце, загальний час проходження дистанції, кількість промахів) та вказує найкращий час стрільби та гонки, де це відбулося. Розділювачем у файлі вважається знак \";\", який по замовчуванню також вважається білим символом, а тому ігнорується поза місцями оголошення потрібної інформації." << endl << endl;

	Data data;
	Builder worker;
	if (argc <= 2) {
		string filename;
		if (argc == 1) {
			cout << "Аргументи не надано. Будь-ласка, введіть назву вхідного файлу\nНазва: ";
			getline(cin, filename);
			cout << "Отримано наступну назву файлу з консолі: |" << filename << "|" << endl << endl;
		}
		else if (argc == 2) {
			cout << "Отримано наступну назву файлу з аргументів програми: |" << argv[1] << "|" << endl << endl;
			filename = argv[1];
		}
		if (worker.readFile(filename, &data)) {

			cout << "Файл успішно прочитано та проаналізовано. Будь-ласка, введіть назву вихідного файлу (або просто натисніть Enter, щоб побачити результат тут, в консолі)\nНазва файлу: ";
			string output;
			getline(cin, output);
			if (filename == output)
				cout << "\nВи не можете перезаписати вхідний файл, будь-ласка, оберіть іншу назву вихідного файлу" << endl << endl;
			else {
				cout << "\nЗапис вихідної інформації..." << endl << endl;
				showWinners(&data, output);
			}
		}
		else
			cout << "Помилка зчитування інформації файлу" << endl <<endl;
	}
	else {
		cout << "Надано занадто багато аргументів." << endl << endl;
	}
	cout << "Кінець виконання програми." << endl << endl;
	system("pause");
	return 0;
}